In [1]:
import pandas as pd 
import numpy as np

In [7]:
#  create dataframe 
dict1 = {
    "name":['rohit', 'sanjay', 'rahul', 'ajay', 'kavir'],
    "city":['pune', 'ranchi', 'patna', 'jhar', 'kolkata'],
    "marks":[92,40,35,20,80]
}
dict1

{'name': ['rohit', 'sanjay', 'rahul', 'ajay', 'kavir'],
 'city': ['pune', 'ranchi', 'patna', 'jhar', 'kolkata'],
 'marks': [92, 40, 35, 20, 80]}

In [9]:
df = pd.DataFrame(dict1)
df

     name     city  marks
0   rohit     pune     92
1  sanjay   ranchi     40
2   rahul    patna     35
3    ajay     jhar     20
4   kavir  kolkata     80

In [15]:
df.to_csv('friend.csv')

In [17]:
df.head(2)

     name    city  marks
0   rohit    pune     92
1  sanjay  ranchi     40

In [19]:
df.tail(2)

    name     city  marks
3   ajay     jhar     20
4  kavir  kolkata     80

In [21]:
df.describe()

           marks
count   5.000000
mean   53.400000
std    30.948344
min    20.000000
25%    35.000000
50%    40.000000
75%    80.000000
max    92.000000

In [34]:
df.index =['first', 'second', 'third', 'four', 'five']

In [36]:
df

          name     city  marks
first    rohit     pune     92
second  sanjay   ranchi     40
third    rahul    patna     35
four      ajay     jhar     20
five     kavir  kolkata     80

In [48]:
ser = pd.Series(np.random.rand(25))
ser

0     0.938280
1     0.566582
2     0.261233
3     0.952433
4     0.860153
5     0.222610
6     0.537025
7     0.072033
8     0.094884
9     0.762402
10    0.206630
11    0.589543
12    0.323407
13    0.310999
14    0.241342
15    0.893295
16    0.379399
17    0.735841
18    0.323808
19    0.649558
20    0.034452
21    0.888588
22    0.562564
23    0.241123
24    0.221670
dtype: float64

In [50]:
type(ser)

pandas.core.series.Series

In [52]:
newdf = pd.DataFrame(np.random.rand(320,5),index=np.arange(320))

In [58]:
newdf.head()

          0         1         2         3         4
0  0.790727  0.392320  0.448117  0.684822  0.761302
1  0.107905  0.492733  0.979307  0.811124  0.933788
2  0.700586  0.765867  0.577239  0.929708  0.512515
3  0.357615  0.507378  0.035435  0.266916  0.613522
4  0.390429  0.606655  0.278521  0.202196  0.220645

In [64]:
newdf

            0         1         2         3         4
0    0.790727  0.392320  0.448117  0.684822  0.761302
1    0.107905  0.492733  0.979307  0.811124  0.933788
2    0.700586  0.765867  0.577239  0.929708  0.512515
3    0.357615  0.507378  0.035435  0.266916  0.613522
4    0.390429  0.606655  0.278521  0.202196  0.220645
..        ...       ...       ...       ...       ...
315  0.470651  0.527411  0.724201  0.129874  0.867560
316  0.048934  0.313851  0.313585  0.803639  0.476061
317  0.887173  0.501245  0.583412  0.297917  0.866582
318  0.441477  0.816632  0.608995  0.982093  0.198455
319  0.462185  0.182972  0.263030  0.847508  0.448411

[320 rows x 5 columns]

In [66]:
type(newdf)

pandas.core.frame.DataFrame

In [68]:
newdf.describe()

                0           1           2           3           4
count  320.000000  320.000000  320.000000  320.000000  320.000000
mean     0.487685    0.513363    0.484222    0.489629    0.516722
std      0.289745    0.283813    0.301621    0.288699    0.297167
min      0.007429    0.001337    0.003627    0.003119    0.002571
25%      0.220331    0.263922    0.220360    0.234542    0.251008
50%      0.484145    0.524488    0.475158    0.479549    0.527733
75%      0.748783    0.751592    0.747645    0.728607    0.771622
max      0.995775    0.999920    0.999633    0.996202    0.993133

In [72]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [76]:
newdf[0][0]= 'harry'

C:\Users\DELL\AppData\Local\Temp\ipykernel_15864\2980316308.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]= 'harry'
C:\Users\DELL\AppData\Local\Temp\ipykernel_15864\2980316308.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]= 'harry'

In [86]:
newdf[4][0]='Ashok'

C:\Users\DELL\AppData\Local\Temp\ipykernel_15864\583416071.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[4][0]='Ashok'
C:\Users\DELL\AppData\Local\Temp\ipykernel_15864\583416071.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[4][0]='Ashok'
C:\Users\DELL\AppData\Local\Temp\ipykernel_15864\583416071.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Ashok' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[4][0]='Ashok'

In [88]:
newdf.head()

          0         1         2         3         4
0     harry  0.392320  0.448117  0.684822     Ashok
1  0.107905  0.492733  0.979307  0.811124  0.933788
2  0.700586  0.765867  0.577239  0.929708  0.512515
3  0.357615  0.507378  0.035435  0.266916  0.613522
4     Ashok  0.606655  0.278521  0.202196  0.220645

In [90]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       310, 311, 312, 313, 314, 315, 316, 317, 318, 319],
      dtype='int32', length=320)

In [92]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [94]:
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0       harry  0.392320  0.448117  0.684822     Ashok
1    0.107905  0.492733  0.979307  0.811124  0.933788
2    0.700586  0.765867  0.577239  0.929708  0.512515
3    0.357615  0.507378  0.035435  0.266916  0.613522
4       Ashok  0.606655  0.278521  0.202196  0.220645
..        ...       ...       ...       ...       ...
315  0.470651  0.527411  0.724201  0.129874   0.86756
316  0.048934  0.313851  0.313585  0.803639  0.476061
317  0.887173  0.501245  0.583412  0.297917  0.866582
318  0.441477  0.816632  0.608995  0.982093  0.198455
319  0.462185  0.182972  0.263030  0.847508  0.448411

[320 rows x 5 columns]>